pchwalek/TEST_OT_BT_STM32WB_FREERTOS/STM32_WPAN/App/app_ble.c
#if (L2CAP_REQUEST_NEW_CONN_PARAM != 0 )
  index_con_int = 0; 
  mutex = 1; 
#endif




  /**
   * From here, all initialization are BLE application specific
   */
#if(CFG_BLE_PERIPHERAL != 0)
  //ST SW Engineers converted the below statement to a FreeRTOS-friendly function: Adv_Request()
//  UTIL_SEQ_RegTask( 1<<CFG_TASK_START_ADV_ID, UTIL_SEQ_RFU, Adv_Request);
  /**
    * Create timer for Data Throughput process (write data)
    */
  HW_TS_Create(CFG_TIM_PROC_ID_ISR, &(TimerDataThroughputWrite_Id), hw_ts_SingleShot, DataThroughput_proc);
#endif

#if(CFG_BLE_CENTRAL != 0)
  //TODO: below not converted to FreeRTOS but the goal is to implement the peripheral above
//  UTIL_SEQ_RegTask( 1<<CFG_TASK_START_SCAN_ID, UTIL_SEQ_RFU, Scan_Request);
//  UTIL_SEQ_RegTask( 1<<CFG_TASK_CONN_DEV_1_ID, UTIL_SEQ_RFU, Connect_Request);
//  UTIL_SEQ_RegTask( 1<<CFG_TASK_CONN_UPDATE_ID, UTIL_SEQ_RFU, Connection_Update);
#endif

  BleApplicationContext.DeviceServerFound = NO_DEVICE_FOUND;

  /**
   * Clear DataBase
   */
  aci_gap_clear_security_db();

  /**
   * Initialize Data Server (GATT SERVER)
   */

  DTS_App_Init();


//  /**
//     * Initialize Data Client (GATT Client)
//     */
//  DTC_App_Init();


//  status = hci_le_set_data_length(BleApplicationContext.BleApplicationContext_legacy.connectionHandle,251,2120);

  LinkConfigProcessId= osThreadNew(LinkConfiguration, NULL, &LinkConfigProcess_attr);


  //TODO: ripped from heartbeat. I think this sends the manufacturer information to the connecting device
  /**
   * Initialize DIS Application
   */
  DISAPP_Init();


  /**
   * Initialize P2P Server Application
   */
  //TODO: there is a SEQUENCER call here that should be FreeRTOS.... commenting for now
//  P2PS_APP_Init();


#ifndef DYNAMIC_MODE
  /**
   * Create timer to handle the Advertising Stop
   */
  HW_TS_Create(CFG_TIM_PROC_ID_ISR, &(BleApplicationContext.Advertising_mgr_timer_Id), hw_ts_SingleShot, Adv_Cancel_Req);
#endif
  /**
   * Create timer to handle the Led Switch OFF
   */
  HW_TS_Create(CFG_TIM_PROC_ID_ISR, &(BleApplicationContext.SwitchOffGPIO_timer_Id), hw_ts_SingleShot, Switch_OFF_GPIO);
  return;
}

void APP_BLE_Init_Dyn_2( void ) {
  /**
   * Make device discoverable
   */
  BleApplicationContext.BleApplicationContext_legacy.advtServUUID[0] = NULL; //TODO: the heartbeat example uses: AD_TYPE_16_BIT_SERV_UUID
  BleApplicationContext.BleApplicationContext_legacy.advtServUUIDlen = 0;
  /* Initialize intervals for reconnexion without intervals update */
  AdvIntervalMin = CFG_FAST_CONN_ADV_INTERVAL_MIN;
  AdvIntervalMax = CFG_FAST_CONN_ADV_INTERVAL_MAX;

  /**
   * Start to Advertise to be connected by P2P Client
   */
#ifndef DYNAMIC_MODE
   Adv_Request(APP_BLE_FAST_ADV);
#else
   Adv_Request(APP_BLE_LP_ADV);
#endif
/* USER CODE BEGIN APP_BLE_Init_2 */

/* USER CODE END APP_BLE_Init_2 */
  return;
}

SVCCTL_UserEvtFlowStatus_t SVCCTL_App_Notification( void *pckt )
{
  hci_event_pckt *event_pckt;
  evt_le_meta_event *meta_evt;
  evt_blue_aci *blue_evt;

  hci_le_connection_complete_event_rp0 * connection_complete_event;
  hci_le_advertising_report_event_rp0 * le_advertising_event;
  hci_le_phy_update_complete_event_rp0 *evt_le_phy_update_complete;
  hci_le_connection_update_complete_event_rp0 *connection_update_complete;
  uint8_t event_type, event_data_size;
  int k = 0;
  uint8_t adtype, adlength;
  uint8_t *adv_report_data;
  float Connection_Interval;
  float Supervision_Timeout;

  event_pckt = (hci_event_pckt*) ((hci_uart_pckt *) pckt)->data;

  switch (event_pckt->evt)
  {
    case EVT_DISCONN_COMPLETE:
    {
      hci_disconnection_complete_event_rp0 *disconnection_complete_event;
      disconnection_complete_event = (hci_disconnection_complete_event_rp0 *) event_pckt->data;

      if (disconnection_complete_event->Connection_Handle == BleApplicationContext.BleApplicationContext_legacy.connectionHandle)
      {
        BleApplicationContext.BleApplicationContext_legacy.connectionHandle = 0;
        BleApplicationContext.Device_Connection_Status = APP_BLE_IDLE;
        APP_DBG_MSG("\r\n\r** DISCONNECTION EVENT WITH CLIENT \n");
      }  
       /* restart advertising */
       Adv_Request(APP_BLE_FAST_ADV);
 /*
* SPECIFIC to P2P Server APP
*/     
        handleNotification.P2P_Evt_Opcode = PEER_DISCON_HANDLE_EVT;
        handleNotification.ConnectionHandle = BleApplicationContext.BleApplicationContext_legacy.connectionHandle;
        P2PS_APP_Notification(&handleNotification);

      /* USER CODE BEGIN EVT_DISCONN_COMPLETE */

      /* USER CODE END EVT_DISCONN_COMPLETE */
    }

    break; /* EVT_DISCONN_COMPLETE */




    case EVT_LE_META_EVENT:
    {
      meta_evt = (evt_le_meta_event*) event_pckt->data;
      /* USER CODE BEGIN EVT_LE_META_EVENT */

      /* USER CODE END EVT_LE_META_EVENT */
      switch (meta_evt->subevent)
      {
      case EVT_LE_PHY_UPDATE_COMPLETE:
        evt_le_phy_update_complete = (hci_le_phy_update_complete_event_rp0*)meta_evt->data;
        if (evt_le_phy_update_complete->Status == 0)
        {
          APP_DBG_MSG("EVT_UPDATE_PHY_COMPLETE, success \n");
        }
        else
        {
          APP_DBG_MSG("EVT_UPDATE_PHY_COMPLETE, failure %d \n", evt_le_phy_update_complete->Status);
        }

        break;
        case EVT_LE_CONN_UPDATE_COMPLETE: 
          APP_DBG_MSG("\r\n\r** CONNECTION UPDATE EVENT WITH CLIENT \n");

          //TODO: added from throughput example
          mutex = 1;
          connection_update_complete = (hci_le_connection_update_complete_event_rp0*)meta_evt->data;

          APP_DBG_MSG("EVT_LE_CONN_UPDATE_COMPLETE \n");
          Connection_Interval = connection_update_complete->Conn_Interval * 1.25;
          APP_DBG_MSG("interval= %.2f ms \n",Connection_Interval);
          APP_DBG_MSG("latency= 0x%x \n",connection_update_complete->Conn_Latency);
          Supervision_Timeout = connection_update_complete->Supervision_Timeout * 10;
          APP_DBG_MSG("supervision_timeout= %.2f ms \n",Supervision_Timeout);

          break;
        case EVT_LE_CONN_COMPLETE:
          {
          hci_le_connection_complete_event_rp0 *connection_complete_event;

          /**
           * The connection is done, there is no need anymore to schedule the LP ADV
           */
          connection_complete_event = (hci_le_connection_complete_event_rp0 *) meta_evt->data;
          
